<?php get_header();
$page_id = get_the_ID(); ?>
<div class="info-page wrapper filler">
    <?php woocommerce_breadcrumb(); ?>
    <div class="info-page__content d-flex">
        <div class="info-page__content__col1">
            <?php wp_nav_menu([
                'menu' => 'Info Page Menu',
                'container' => 'nav',
                'container_class' => 'info-page__menu'
            ]); ?>
        </div>
        <div class="info-page__content__col2">
            <?php if(is_page('Питання та відповіді')) { ?>
                <h1 class="section-title">Питання та відповіді</h1>
                <div class="info-page__content__item wysiwyg-styles"><?php the_content(); ?></div>
            <?php } elseif (is_page('Доставка')) { ?>
                <h1 class="section-title">Доставка</h1>
                <div class="info-page__content__item wysiwyg-styles"><?php the_content(); ?></div>
            <?php } elseif (is_page('Оплата')) { ?>
                <h1 class="section-title">Оплата</h1>
                <div class="info-page__content__item wysiwyg-styles"><?php the_content(); ?></div>
            <?php } elseif (is_page('Повернення та гарантія')) { ?>
                <h1 class="section-title">Повернення та гарантія</h1>
                <div class="info-page__content__item wysiwyg-styles">
                    <div class="item__icontext d-flex align-items-center">
                        <div class="item__icontext-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
                                <path d="M4.47835 12.9889L4.47848 12.9891C5.62233 15.294 7.92941 16.725 10.5007 16.725C14.2087 16.725 17.2257 13.708 17.2257 10C17.2257 6.29201 14.2087 3.275 10.5007 3.275C8.03905 3.275 5.8114 4.62668 4.6423 6.725H7.1674C7.59524 6.725 7.9424 7.07216 7.9424 7.5C7.9424 7.92784 7.59524 8.275 7.1674 8.275H3.00073C2.57289 8.275 2.22573 7.92784 2.22573 7.5V3.33333C2.22573 2.90549 2.57289 2.55833 3.00073 2.55833C3.42858 2.55833 3.77573 2.90549 3.77573 3.33333V5.18563C5.30051 3.05494 7.78855 1.725 10.5007 1.725H10.5008C15.0627 1.72585 18.7749 5.43798 18.7749 10.0008C18.7749 14.5637 15.0628 18.2758 10.4999 18.2758C7.33711 18.2758 4.49772 16.5136 3.08988 13.6786L4.47835 12.9889ZM4.47835 12.9889C4.28854 12.6082 3.82561 12.4474 3.4389 12.6397C3.05689 12.8297 2.89854 13.2946 3.08977 13.6784L4.47835 12.9889Z" fill="#6757A9" stroke="#6757A9" stroke-width="0.3"/>
                            </svg>
                        </div>
                        <h4 class="item__icontext-title font-16-22 fw-600">Як повернути товар?</h4>
                    </div>
                    <div class="item__additional d-flex align-items-center">
                        <div class="item__additional-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                                <path d="M12.251 20.1197V11.3867C12.515 11.3337 12.775 11.2547 13.025 11.1457L19.6799 8.18869C19.7149 8.34669 19.751 8.50472 19.751 8.67072V10.9997C19.751 11.4137 20.087 11.7497 20.501 11.7497C20.915 11.7497 21.251 11.4137 21.251 10.9997V8.67072C21.251 8.03372 21.0809 7.4267 20.7889 6.8887C20.7869 6.8847 20.788 6.88071 20.786 6.87671C20.782 6.86671 20.7729 6.86072 20.7679 6.85172C20.3799 6.15672 19.782 5.58271 19.025 5.24671L13.028 2.57871C12.056 2.14371 10.944 2.1427 9.97595 2.5777L3.97595 5.24671C3.21995 5.58271 2.62103 6.15672 2.23303 6.85172C2.22803 6.86172 2.21897 6.86671 2.21497 6.87671C2.21297 6.88071 2.21404 6.8847 2.21204 6.8887C1.92004 7.4267 1.75 8.03372 1.75 8.67072V15.3277C1.75 16.8067 2.62395 18.1507 3.97595 18.7517L9.97302 21.4187C10.462 21.6387 10.9829 21.7497 11.5029 21.7497C11.9259 21.7497 12.349 21.6767 12.755 21.5297C13.145 21.3887 13.346 20.9587 13.205 20.5697C13.066 20.1827 12.637 19.9827 12.251 20.1197ZM10.589 3.9477C11.169 3.6867 11.834 3.6877 12.416 3.9487L18.416 6.61771C18.584 6.69271 18.7309 6.79671 18.8729 6.90671L16.145 8.11872L8.89001 4.70371L10.589 3.9477ZM7.07898 5.5087L14.333 8.92371L12.421 9.77371C11.835 10.0287 11.1639 10.0277 10.5859 9.7757L4.12903 6.90671C4.27003 6.79671 4.41794 6.69271 4.58594 6.61771L7.07898 5.5087ZM4.58594 17.3817C3.77494 17.0217 3.25098 16.2147 3.25098 15.3277V8.67072C3.25098 8.50472 3.28702 8.34669 3.32202 8.18869L9.98193 11.1477C10.2309 11.2557 10.489 11.3347 10.752 11.3867V20.1067C10.697 20.0867 10.641 20.0747 10.587 20.0507L4.58594 17.3817ZM20.501 16.9997C20.501 17.4137 20.165 17.7497 19.751 17.7497H17.251C16.837 17.7497 16.501 17.4137 16.501 16.9997C16.501 16.5857 16.837 16.2497 17.251 16.2497H19.751C20.165 16.2497 20.501 16.5847 20.501 16.9997ZM18.501 12.2497C15.882 12.2497 13.751 14.3807 13.751 16.9997C13.751 19.6187 15.882 21.7497 18.501 21.7497C21.12 21.7497 23.251 19.6187 23.251 16.9997C23.251 14.3807 21.12 12.2497 18.501 12.2497ZM18.501 20.2497C16.709 20.2497 15.251 18.7917 15.251 16.9997C15.251 15.2077 16.709 13.7497 18.501 13.7497C20.293 13.7497 21.751 15.2077 21.751 16.9997C21.751 18.7917 20.293 20.2497 18.501 20.2497Z" fill="#6757A9"/>
                            </svg>
                        </div>
                        <p class="item__additional-text font-13-16 fw-400">Товар можна повернути або обміняти протягом 14 днів після отримання замовлення.</p>
                    </div>
                    <ol class="item__num-list font-13-16 fw-400">
                        <li>Ознайомтесь зі списком товарiв, якi не пiдлягають поверненню.</li>
                        <br>
                        <li>Напишiть запит на пошту service@mamashop.com.ua, або в Telegram. У запиті вкажіть:
                            <ul class="item__dot-list">
                                <li>номер замовлення або номер телефону;</li>
                                <li>товар(и), якi повертаєте, та причину повернення;</li>
                                <li>додайте фото дефектiв (якщо є).</li>
                            </ul>
                        </li>
                        <br>
                        <li>Чекайте на відповідь протягом 3 робочих днів (пн-пт з 9:00 до 18:00).</li>
                    </ol>
                    <h4>Заява на повернення коштів</h4>
                    <ol class="item__num-list font-13-16 fw-400">
                        <li>Скан-копію або фото заяви, заповненої від руки (завантажити заяву) чи написаної від руки, якщо немає можливості роздрукувати шаблон. Обов'язкові для заповнення всі поля. Інструкція щодо заповнення заяви тут.</li>
                        <br>
                        <li>Скан-копію або фото паспорта (1-4 сторінка).</li>
                    </ol>
                </div>
            <?php } elseif (is_page('Про нас')) { ?>
                <h1 class="section-title">Про нас</h1>
                <?php $about_us = get_field('about_us');
                foreach ($about_us as $item) { ?>
                    <div class="info-page__content__item wysiwyg-styles">
                        <h4><?= $item['title']; ?></h4>
                        <p><?= $item['text']; ?></p>
                    </div>
                <?php } ?>
            <?php } elseif (is_page('Умови використання')) { ?>
                <h1 class="section-title">Умови використання</h1>
                <div class="info-page__content__item wysiwyg-styles">
                    <div class="item__icontext d-flex align-items-center">
                        <div class="item__icontext-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
                                <path d="M18.3247 6.74362L12.7895 1.20833C12.6594 1.07825 12.4841 1.00537 12.3005 1.00537H6.76519C4.53447 1.00537 3.30563 2.2342 3.30563 4.46492V15.5355C3.30563 17.7662 4.53447 18.9951 6.76519 18.9951H15.0681C17.2988 18.9951 18.5277 17.7662 18.5277 15.5355V7.23257C18.5277 7.04898 18.4548 6.87278 18.3247 6.74362ZM12.9924 3.36802L16.165 6.54066H15.0681C13.6133 6.54066 12.9924 5.91978 12.9924 4.46492V3.36802ZM15.0681 17.6112H6.76519C5.31033 17.6112 4.68946 16.9904 4.68946 15.5355V4.46492C4.68946 3.01007 5.31033 2.38919 6.76519 2.38919H11.6086V4.46492C11.6086 6.69564 12.8374 7.92448 15.0681 7.92448H17.1438V15.5355C17.1438 16.9904 16.523 17.6112 15.0681 17.6112ZM14.8375 10.0002C14.8375 10.3821 14.5275 10.6921 14.1456 10.6921H7.68773C7.3058 10.6921 6.99582 10.3821 6.99582 10.0002C6.99582 9.61828 7.3058 9.3083 7.68773 9.3083H14.1456C14.5275 9.3083 14.8375 9.61828 14.8375 10.0002ZM12.0698 13.6904C12.0698 14.0723 11.7599 14.3823 11.3779 14.3823H7.68773C7.3058 14.3823 6.99582 14.0723 6.99582 13.6904C6.99582 13.3085 7.3058 12.9985 7.68773 12.9985H11.3779C11.7599 12.9985 12.0698 13.3085 12.0698 13.6904Z" fill="#6757A9"/>
                            </svg>
                        </div>
                        <h4 class="item__icontext-title font-16-22 fw-600">Договір публічної оферти про продаж товарів та надання послуг</h4>
                    </div>
                    <p class="item__icontext-text font-13-16 fw-400">
                        Ця публічна оферта є офіційною пропозицією (публічним договором) ТОВ «Mamashop» відповідно до ст.633 Цивільного Кодексу.
                        <br><br>
                        Будь-яке використання веб-сайту mamashop.com.ua, в тому числі, перегляд інформації, користування сервісами, реєстрація, замовлення товарів тощо, здійснюється у відповідності до умов цієї публічної оферти (далі – Публічна оферта), яка включає в себе умови, зазначені нижче, а також умови, зазначені у відповідних розділах (сторінках) веб-сайту mamashop.com.ua.
                        <br><br>
                        Використовуючи веб-сайт mamashop.com.ua, в тому числі, але не обмежуючись, шляхом реєстрації на ньому та/або шляхом придбання (здійснення дій щодо придбання) та/або оплати Товару, Покупець беззастережно приймає всі умови Публічної оферти (здійснює акцепт умов Публічної оферти), погоджується виконувати їх та несе відповідальність за наслідки неознайомлення з ними.
                    </p>
                </div>
                <div class="info-page__content__item wysiwyg-styles">
                    <div class="item__icontext d-flex align-items-center">
                        <div class="item__icontext-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
                                <path d="M16.2617 1.35742H6.0679C3.92454 1.35742 2.74384 2.53813 2.74384 4.68149V15.3185C2.74384 17.3067 4.07967 18.6426 6.0679 18.6426H16.2617C17.3609 18.6426 18.2562 17.7482 18.2562 16.6481V11.3296V9.11358V3.35186C18.2562 2.25182 17.3609 1.35742 16.2617 1.35742ZM6.0679 2.68705H16.2617C16.6278 2.68705 16.9265 2.98489 16.9265 3.35186V9.11358V11.3296C16.9265 11.6966 16.6278 11.9944 16.2617 11.9944H6.0679C5.28697 11.9944 4.61152 12.2063 4.07346 12.5777V4.68149C4.07346 3.28361 4.67002 2.68705 6.0679 2.68705ZM16.2617 17.313H6.0679C4.81894 17.313 4.07346 16.5675 4.07346 15.3185C4.07346 14.0695 4.81894 13.3241 6.0679 13.3241H16.2617C16.4957 13.3241 16.7173 13.2763 16.9265 13.2018V16.6481C16.9265 17.0151 16.6278 17.313 16.2617 17.313ZM7.17593 5.56791C7.17593 5.20093 7.47376 4.9031 7.84074 4.9031H13.1593C13.5262 4.9031 13.8241 5.20093 13.8241 5.56791C13.8241 5.93489 13.5262 6.23272 13.1593 6.23272H7.84074C7.47376 6.23272 7.17593 5.93489 7.17593 5.56791ZM7.17593 8.22716C7.17593 7.86019 7.47376 7.56235 7.84074 7.56235H11.3864C11.7534 7.56235 12.0512 7.86019 12.0512 8.22716C12.0512 8.59414 11.7534 8.89198 11.3864 8.89198H7.84074C7.47376 8.89198 7.17593 8.59414 7.17593 8.22716Z" fill="#6757A9"/>
                            </svg>
                        </div>
                        <h4 class="item__icontext-title font-16-22 fw-600">Положення та умови</h4>
                    </div>
                    <p class="item__icontext-text font-13-16 fw-400">
                        2.1. Товар на Сайті може бути замовлений та придбаний тільки для особистого некомерційного використання (споживання).
                        <br><br>
                        2.2. Здійснюючи реєстрацію та/або придбання Товару на Сайті (вчинення дій щодо придбання Товару, оформлення Замовлення, оплати Товару, безпосереднє Замовлення Товару тощо), особа засвідчує, що вона:
                        <br><br>
                        досягла 18-річного віку, володіє повною цивільною дієздатністю та купуватиме Товар виключно для особистого некомерційного використання (споживання);
                        ознайомлена, беззастережно приймає та погоджується з усіма умовами Публічної оферти та умовами, викладеними у розділах (сторінках) Сайту;
                        ознайомлена, беззастережно приймає та погоджується виконувати усі умови Публічної оферти;
                        зазначає дані (П.І.Б., мобільний телефон, e-mail тощо), що є правдивими та належать саме їй, або авторизується під власним обліковим записом у соціальній мережі;
                        погоджується на передачу своїх персональних даних третім особам (в тому числі іноземним суб'єктам відносин, пов'язаних з персональними даними), їх обробку, зберігання, передачу і використання з метою та на умовах, визначених Публічною офертою, та засвідчує отримання інформації про володільця персональних даних, склад та зміст зібраних персональних даних, свої права згідно законодавства, мету збору персональних даних та осіб, яким передаються її персональні дані.
                        <br><br>
                        2.3. При користуванні Сайтом Покупець має право використовувати лише ті персональні дані, банківські картки, банківські рахунки, документи, що належать йому на законних підставах (оформлені на його ім’я в установленому законом порядку).
                        <br><br>
                        2.4. Дані Покупця, зазначені при реєстрації та/або придбанні Товару на Сайті, зберігаються Адміністратором/Продавцем і відображаються у Профілі та використовуються Адміністратором та Продавцями в подальшому при здійсненні та / або виконанні Замовлень Покупця.
                        <br><br>
                        2.5. Покупець має право змінювати та доповнювати надані ним дані в Профілі протягом всього строку здійснення покупок на Сайті.
                        <br><br>
                        2.6. Розміщуючи на Сайті свої пропозиції щодо пропонування Товару, Продавець, який не є Адміністратором, погоджується та зобов’язується дотримуватись Публічної оферти, включаючи всі умови, зазначені нижче та у відповідних розділах (на сторінках) Сайту.
                    </p>
                </div>
            <?php } elseif (is_page('Контакти')) { ?>
                <h1 class="section-title">Контакти</h1>
                <div class="info-page__content__item wysiwyg-styles">
                    <h4>Служба підтримки</h4>
                    <?php $phones = get_field('phones', 'options');
                    $email = get_field('email', 'options');
                    if (!empty($phones)) {
                        foreach ($phones as $phone) { ?>
                            <div class="contacts__icontext d-flex align-items-center">
                                <div class="contacts__icontext-icon">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="33" height="32" viewBox="0 0 33 32" fill="none">
                                        <rect x="0.5" width="32" height="32" rx="2" fill="#F7F7F8"/>
                                        <path d="M24.4303 20.7054V20.8013C24.4175 20.8333 24.4047 20.8653 24.3983 20.9037C24.3727 21.2938 24.2128 21.62 23.9442 21.895C23.4773 22.3747 22.9976 22.848 22.5242 23.3213C22.294 23.5516 22.0253 23.7179 21.7119 23.8138C21.0467 24.0185 20.3815 23.9481 19.7291 23.7882C18.5394 23.5004 17.4648 22.9376 16.4414 22.2852C15.2261 21.5049 14.1131 20.5839 13.0897 19.5669C11.625 18.115 10.3521 16.516 9.43108 14.6612C8.97055 13.7338 8.61236 12.768 8.57398 11.7126C8.542 10.9899 8.7147 10.3375 9.27117 9.81944C9.63576 9.48045 9.98116 9.12867 10.3266 8.7705C10.64 8.43791 10.9726 8.15009 11.4395 8.06055H11.9064C12.1943 8.14369 12.4757 8.23324 12.7124 8.43151C12.7507 8.46349 12.7827 8.48908 12.8147 8.52106C13.5311 9.23741 14.2475 9.94736 14.9638 10.6701C15.4883 11.201 15.5779 11.9301 15.2069 12.5441C15.0406 12.8128 14.8103 13.0046 14.5161 13.1134C14.0748 13.2733 13.7294 13.5355 13.5375 13.9768C13.4159 14.2646 13.3904 14.5525 13.4735 14.8531C13.7038 15.7229 14.1899 16.4329 14.7847 17.0853C15.3988 17.7568 16.0896 18.3325 16.9147 18.7354C17.2857 18.9145 17.6695 19.0744 18.098 19.0105C18.6289 18.9337 19.0255 18.6715 19.2685 18.1854C19.3773 17.9615 19.4732 17.7121 19.6331 17.533C20.1576 16.9382 21.0723 16.887 21.6799 17.4115C21.9166 17.6161 22.1341 17.8464 22.3579 18.0702C22.8696 18.5755 23.3685 19.0872 23.8802 19.5925C24.1745 19.8867 24.3855 20.2129 24.4047 20.6414C24.4047 20.6606 24.4175 20.6862 24.4303 20.7054Z" fill="#494558"/>
                                    </svg>
                                </div>
                                <a href="tel:+<?= preg_replace('/\D+/', '', $phone['phone_number']); ?>" class="contacts__icontext-phone font-14-20 fw-500 transition-default"><?= $phone['phone_number']; ?></a>
                            </div>
                        <?php }
                    } if ($email) { ?>
                        <div class="contacts__icontext d-flex align-items-center">
                            <div class="contacts__icontext-icon">
                                <svg xmlns="http://www.w3.org/2000/svg" width="33" height="32" viewBox="0 0 33 32" fill="none">
                                    <rect x="0.5" width="32" height="32" rx="2" fill="#F7F7F8"/>
                                    <path d="M9.29432 9.93279L9.29422 9.93269C9.16999 9.80846 9.26004 9.59408 9.43328 9.59408H23.5431C23.7211 9.59408 23.8081 9.80672 23.6821 9.93269L18.644 14.9706L16.6054 17.009C16.5834 17.031 16.5464 17.068 16.5115 17.1003C16.5022 17.1089 16.4933 17.1169 16.4853 17.1239C16.4778 17.1177 16.4697 17.1107 16.4611 17.103C16.4277 17.0731 16.393 17.0384 16.371 17.0163L16.3703 17.0156C14.0116 14.6571 11.6529 12.2986 9.29432 9.93279Z" fill="#494558" stroke="#F7F7F8" stroke-width="0.183286"/>
                                    <path d="M14.4914 16.8691C14.4847 16.8753 14.4772 16.8825 14.4688 16.891L14.404 16.8262L14.4689 16.8908C13.0491 18.3178 11.6075 19.7594 10.2096 21.1572L9.29956 22.0672C9.17358 22.1932 9.26055 22.4058 9.43861 22.4058H23.5339C23.7165 22.4058 23.8007 22.1923 23.6682 22.0696L23.6656 22.0672L23.6656 22.0672L23.0177 21.4193C21.5033 19.905 19.9888 18.3906 18.4744 16.8691C18.1615 17.1953 17.8258 17.5307 17.3881 17.9614C17.388 17.9615 17.3879 17.9616 17.3878 17.9617L17.3235 17.8964C16.792 18.4278 16.1732 18.4278 15.6417 17.8964L14.4914 16.8691ZM14.4914 16.8691C14.4996 16.8769 14.5092 16.8863 14.5204 16.8974L14.4914 16.8691Z" fill="#494558" stroke="#F7F7F8" stroke-width="0.183286"/>
                                    <path d="M13.6328 16.0073C12.1025 17.5304 10.5579 19.0749 9.05674 20.5759L9.05629 20.5764L8.43016 21.2025C8.30591 21.3267 8.09152 21.2366 8.09152 21.0634V10.944C8.09152 10.7659 8.30416 10.6789 8.43016 10.8049L10.7745 13.1491L13.6139 15.9884L13.6787 15.9236L13.614 15.9884L13.6285 16.003L13.6328 16.0073Z" fill="#494558" stroke="#F7F7F8" stroke-width="0.183286"/>
                                    <path d="M22.247 18.8798L19.356 15.9889C20.9169 14.4352 22.4918 12.8605 24.0235 11.3288L24.5688 10.7835C24.6949 10.6634 24.9082 10.7512 24.9082 10.9291V21.0632C24.9082 21.2412 24.6956 21.3282 24.5696 21.2022L22.247 18.8798Z" fill="#494558" stroke="#F7F7F8" stroke-width="0.183286"/>
                                </svg>                        </div>
                            <a href="mailto:<?= $email; ?>" class="contacts__icontext-email font-14-20 fw-500 transition-default"><?= $email; ?></a>
                        </div>
                    <?php } ?>
                    <p class="contacts-additional">Служба підтримки працює з <time>9:00</time> до <time>18:00</time> у будні дні</p>
                </div>
            <?php } else {
                wp_redirect(site_url() . '/404', 404);
                exit;
            } ?>
        </div>
    </div>
</div>
<?php get_footer();