<div class="info-page__content__body info-page__delivery">
    <p class="info-page__delivery-title font-16-22 fw-500">Дорогі клієнти, ми прагнемо забезпечити Вас найкращою доставкою для Вашої зручності.<br>Ось декілька способів, які ми пропонуємо:</p>
    <div id="np-logo" class="info-page__delivery__logo-image img-wrapper-contain">
        <img src="<?php bloginfo('template_url'); ?>/images/nova-poshta.png" alt="Нова Пошта">
    </div>
    <ol class="info-page__delivery__list font-14-20">
        <li class="list__item">
            <h6 class="list__item-title fw-500">Кур'єрська доставка від Нової Пошти</h6>
            <p class="list__item-text fw-400">Наші надійні партнери з Нової Пошти готові привезти ваші замовлення прямо до вашого дому чи офісу. Ви можете розраховувати на їхню швидкість та надійність.</p>
        </li>
        <li class="list__item">
            <h6 class="list__item-title fw-500">Самовивіз з відділення Нової Пошти</h6>
            <p class="list__item-text fw-400">Якщо вам більше до вподоби самостійно забрати своє замовлення, то ви можете обрати найближче відділення Нової Пошти. Просто зайдіть до відділення та заберіть придбані товари.</p>
        </li>
        <li class="list__item">
            <h6 class="list__item-title fw-500">Поштомати Нової Пошти</h6>
            <p class="list__item-text fw-400">
                Зручний спосіб отримати своє замовлення у будь-який час. Ви можете скористатися послугою поштомату, щоб отримати придбані товари без зайвого очікування. Щоб перевірити доступність працюючих поштоматів, відвідайте сайт перевізника
                <a href="https://novaposhta.ua/office/listinternational">[тут]</a>.
            </p>
        </li>
    </ol>
    <p class="info-page__delivery-text font-14-20 fw-400">Якщо у Вас виникли питання або Ви потребуєте додаткову інформацію щодо доставки, будь ласка, зв'яжіться з нашою службою підтримки.</p>
    <div class="info-page__delivery__contacts">
        <div class="contacts__item icon-text d-flex align-items-center">
            <div class="icon-text__icon img-wrapper d-flex justify-content-center align-items-center">
                <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
                    <path d="M23.9303 20.8089V20.9048C23.9175 20.9368 23.9047 20.9688 23.8983 21.0072C23.8727 21.3973 23.7128 21.7235 23.4442 21.9986C22.9773 22.4783 22.4976 22.9516 22.0242 23.4249C21.794 23.6551 21.5253 23.8214 21.2119 23.9173C20.5467 24.122 19.8815 24.0517 19.2291 23.8918C18.0394 23.6039 16.9648 23.0411 15.9414 22.3887C14.7261 21.6084 13.6131 20.6874 12.5897 19.6704C11.125 18.2185 9.85214 16.6195 8.93108 14.7647C8.47055 13.8373 8.11236 12.8715 8.07398 11.8162C8.042 11.0934 8.2147 10.441 8.77117 9.92295C9.13576 9.58397 9.48116 9.23219 9.82656 8.87402C10.14 8.54142 10.4726 8.25361 10.9395 8.16406H11.4064C11.6943 8.24721 11.9757 8.33675 12.2124 8.53503C12.2507 8.56701 12.2827 8.59259 12.3147 8.62457C13.0311 9.34092 13.7475 10.0509 14.4638 10.7736C14.9883 11.3045 15.0779 12.0336 14.7069 12.6476C14.5406 12.9163 14.3103 13.1081 14.0161 13.2169C13.5748 13.3768 13.2294 13.639 13.0375 14.0803C12.9159 14.3682 12.8904 14.656 12.9735 14.9566C13.2038 15.8264 13.6899 16.5364 14.2847 17.1888C14.8988 17.8604 15.5896 18.436 16.4147 18.8389C16.7857 19.018 17.1695 19.1779 17.598 19.114C18.1289 19.0372 18.5255 18.775 18.7685 18.2889C18.8773 18.065 18.9732 17.8156 19.1331 17.6365C19.6576 17.0417 20.5723 16.9905 21.1799 17.515C21.4166 17.7196 21.6341 17.9499 21.8579 18.1738C22.3696 18.679 22.8685 19.1907 23.3802 19.696C23.6745 19.9902 23.8855 20.3164 23.9047 20.7449C23.9047 20.7641 23.9175 20.7897 23.9303 20.8089Z" fill="#6757A9"/>
                </svg>
            </div>
            <a href="tel:380000000000" class="icon-text__link font-15-24 fw-500 transition-default">+38 (000) 000 00 00</a>
        </div>
        <div class="contacts__item icon-text d-flex align-items-center">
            <div class="icon-text__icon img-wrapper d-flex justify-content-center align-items-center">
                <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
                    <path d="M8.79438 10.0368L8.79428 10.0367C8.67005 9.91247 8.7601 9.69809 8.93334 9.69809H23.0431C23.2212 9.69809 23.3082 9.91072 23.1822 10.0367L18.144 15.0746L16.1055 17.113C16.0835 17.135 16.0465 17.172 16.0116 17.2043C16.0022 17.2129 15.9934 17.2209 15.9853 17.2279C15.9779 17.2217 15.9698 17.2147 15.9612 17.207C15.9278 17.1771 15.8931 17.1424 15.871 17.1203L15.8703 17.1196C13.5116 14.7611 11.153 12.4026 8.79438 10.0368Z" fill="#6757A9" stroke="#F7F7F8" stroke-width="0.183286"/>
                    <path d="M13.9933 16.9736C13.9867 16.9798 13.9792 16.987 13.9707 16.9955L13.9059 16.9307L13.9709 16.9953C12.5511 18.4223 11.1094 19.8639 9.71158 21.2617L8.80151 22.1717C8.67553 22.2977 8.76251 22.5103 8.94057 22.5103H23.0358C23.2185 22.5103 23.3027 22.2968 23.1701 22.1741L23.1675 22.1717L23.1676 22.1717L22.5196 21.5237C21.0052 20.0095 19.4908 18.4951 17.9763 16.9736C17.6635 17.2998 17.3278 17.6352 16.89 18.0659C16.8899 18.066 16.8898 18.0661 16.8897 18.0662L16.8255 18.0009C16.294 18.5323 15.6751 18.5323 15.1436 18.0009L13.9933 16.9736ZM13.9933 16.9736C14.0015 16.9814 14.0111 16.9908 14.0223 17.0019L13.9933 16.9736Z" fill="#6757A9" stroke="#F7F7F8" stroke-width="0.183286"/>
                    <path d="M13.1328 16.1113C11.6025 17.6344 10.0579 19.1789 8.55674 20.6799L8.55629 20.6804L7.93016 21.3065C7.80591 21.4307 7.59152 21.3406 7.59152 21.1674V11.048C7.59152 10.8699 7.80416 10.7829 7.93016 10.9089L10.2745 13.2532L13.1139 16.0924L13.1787 16.0276L13.114 16.0924L13.1285 16.107L13.1328 16.1113Z" fill="#6757A9" stroke="#F7F7F8" stroke-width="0.183286"/>
                    <path d="M21.747 18.9843L18.856 16.0934C20.4169 14.5397 21.9918 12.965 23.5235 11.4333L24.0688 10.888C24.1949 10.7679 24.4082 10.8557 24.4082 11.0336V21.1676C24.4082 21.3457 24.1956 21.4327 24.0696 21.3067L21.747 18.9843Z" fill="#6757A9" stroke="#F7F7F8" stroke-width="0.183286"/>
                </svg>
            </div>
            <a href="mailto:email00@gmail.com" class="icon-text__link font-15-24 fw-500 transition-default">email00@gmail.com</a>
        </div>
    </div>
    <p class="info-page__delivery-text font-14-20 fw-500">Дякуємо, що обрали наш магазин для Ваших покупок. Ми робимо все можливе, щоб забезпечити Вас найкращим обслуговуванням.</p>
</div>
