<?php $email = get_field('email', 'options') ?? ''; ?>
<div class="info-page__content__body info-page__return">
    <h4 class="return__title font-16-22 fw-600">Як повернути товар?</h4>
    <div class="return__additional icon-text d-flex align-items-center">
        <div class="icon-text__icon">
            <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                <path d="M12.251 20.1197V11.3867C12.515 11.3337 12.775 11.2547 13.025 11.1457L19.6799 8.18869C19.7149 8.34669 19.751 8.50472 19.751 8.67072V10.9997C19.751 11.4137 20.087 11.7497 20.501 11.7497C20.915 11.7497 21.251 11.4137 21.251 10.9997V8.67072C21.251 8.03372 21.0809 7.4267 20.7889 6.8887C20.7869 6.8847 20.788 6.88071 20.786 6.87671C20.782 6.86671 20.7729 6.86072 20.7679 6.85172C20.3799 6.15672 19.782 5.58271 19.025 5.24671L13.028 2.57871C12.056 2.14371 10.944 2.1427 9.97595 2.5777L3.97595 5.24671C3.21995 5.58271 2.62103 6.15672 2.23303 6.85172C2.22803 6.86172 2.21897 6.86671 2.21497 6.87671C2.21297 6.88071 2.21404 6.8847 2.21204 6.8887C1.92004 7.4267 1.75 8.03372 1.75 8.67072V15.3277C1.75 16.8067 2.62395 18.1507 3.97595 18.7517L9.97302 21.4187C10.462 21.6387 10.9829 21.7497 11.5029 21.7497C11.9259 21.7497 12.349 21.6767 12.755 21.5297C13.145 21.3887 13.346 20.9587 13.205 20.5697C13.066 20.1827 12.637 19.9827 12.251 20.1197ZM10.589 3.9477C11.169 3.6867 11.834 3.6877 12.416 3.9487L18.416 6.61771C18.584 6.69271 18.7309 6.79671 18.8729 6.90671L16.145 8.11872L8.89001 4.70371L10.589 3.9477ZM7.07898 5.5087L14.333 8.92371L12.421 9.77371C11.835 10.0287 11.1639 10.0277 10.5859 9.7757L4.12903 6.90671C4.27003 6.79671 4.41794 6.69271 4.58594 6.61771L7.07898 5.5087ZM4.58594 17.3817C3.77494 17.0217 3.25098 16.2147 3.25098 15.3277V8.67072C3.25098 8.50472 3.28702 8.34669 3.32202 8.18869L9.98193 11.1477C10.2309 11.2557 10.489 11.3347 10.752 11.3867V20.1067C10.697 20.0867 10.641 20.0747 10.587 20.0507L4.58594 17.3817ZM20.501 16.9997C20.501 17.4137 20.165 17.7497 19.751 17.7497H17.251C16.837 17.7497 16.501 17.4137 16.501 16.9997C16.501 16.5857 16.837 16.2497 17.251 16.2497H19.751C20.165 16.2497 20.501 16.5847 20.501 16.9997ZM18.501 12.2497C15.882 12.2497 13.751 14.3807 13.751 16.9997C13.751 19.6187 15.882 21.7497 18.501 21.7497C21.12 21.7497 23.251 19.6187 23.251 16.9997C23.251 14.3807 21.12 12.2497 18.501 12.2497ZM18.501 20.2497C16.709 20.2497 15.251 18.7917 15.251 16.9997C15.251 15.2077 16.709 13.7497 18.501 13.7497C20.293 13.7497 21.751 15.2077 21.751 16.9997C21.751 18.7917 20.293 20.2497 18.501 20.2497Z" fill="#6757A9"/>
            </svg>
        </div>
        <p class="item-text__text font-13-16 fw-400">Товар можна повернути або обміняти протягом 14 днів після отримання замовлення.</p>
    </div>
    <ol class="return__num-list font-13-16 fw-400">
        <li>Ознайомтесь зі <a href="https://dp.dpss.gov.ua/news/yaki-tovari-ne-mozhlivo-povernuti-vprodovzh-14-dniv" target="_blank">списком товарiв</a>, якi не пiдлягають поверненню.</li>
        <li>Напишiть запит на пошту <a href="mailto:<?= $email ?>"><?= $email ?></a>, або в <a href="#" target="_blank">Telegram</a>. У запиті вкажіть:
            <ul class="return__dot-list">
                <li>номер замовлення або номер телефону;</li>
                <li>товар(и), якi повертаєте, та причину повернення;</li>
                <li>додайте фото дефектiв (якщо є).</li>
            </ul>
        </li>
        <li>Чекайте на відповідь протягом 3 робочих днів (пн-пт з 9:00 до 18:00).</li>
    </ol>
    <h4 class="return__title--second font-16-22 fw-600">Заява на повернення коштів</h4>
    <ol class="return__num-list font-13-16 fw-400">
        <li>Скан-копію або фото заяви, заповненої від руки (завантажити заяву) чи написаної від руки, якщо немає можливості роздрукувати шаблон. Обов'язкові для заповнення всі поля. Інструкція щодо заповнення заяви тут.</li>
        <li>Скан-копію або фото паспорта (1-4 сторінка).</li>
    </ol>
</div>
