<div class="info-page__content__body info-page__terms">
    <div class="terms__item__head icon-text d-flex align-items-center">
        <div class="icon-text__icon img-wrapper d-flex justify-content-center align-items-center">
            <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
                <path d="M18.3247 6.74362L12.7895 1.20833C12.6594 1.07825 12.4841 1.00537 12.3005 1.00537H6.76519C4.53447 1.00537 3.30563 2.2342 3.30563 4.46492V15.5355C3.30563 17.7662 4.53447 18.9951 6.76519 18.9951H15.0681C17.2988 18.9951 18.5277 17.7662 18.5277 15.5355V7.23257C18.5277 7.04898 18.4548 6.87278 18.3247 6.74362ZM12.9924 3.36802L16.165 6.54066H15.0681C13.6133 6.54066 12.9924 5.91978 12.9924 4.46492V3.36802ZM15.0681 17.6112H6.76519C5.31033 17.6112 4.68946 16.9904 4.68946 15.5355V4.46492C4.68946 3.01007 5.31033 2.38919 6.76519 2.38919H11.6086V4.46492C11.6086 6.69564 12.8374 7.92448 15.0681 7.92448H17.1438V15.5355C17.1438 16.9904 16.523 17.6112 15.0681 17.6112ZM14.8375 10.0002C14.8375 10.3821 14.5275 10.6921 14.1456 10.6921H7.68773C7.3058 10.6921 6.99582 10.3821 6.99582 10.0002C6.99582 9.61828 7.3058 9.3083 7.68773 9.3083H14.1456C14.5275 9.3083 14.8375 9.61828 14.8375 10.0002ZM12.0698 13.6904C12.0698 14.0723 11.7599 14.3823 11.3779 14.3823H7.68773C7.3058 14.3823 6.99582 14.0723 6.99582 13.6904C6.99582 13.3085 7.3058 12.9985 7.68773 12.9985H11.3779C11.7599 12.9985 12.0698 13.3085 12.0698 13.6904Z" fill="#6757A9"/>
            </svg>
        </div>
        <h4 class="icon-text__text font-16-22 fw-600">Договір публічної оферти про продаж товарів та надання послуг</h4>
    </div>
    <div class="terms__item__text font-13-16 fw-400">
        <p>Ця публічна оферта є офіційною пропозицією (публічним договором) ТОВ «Shop4ik» відповідно до ст.633 Цивільного Кодексу.</p>
        <p>Будь-яке використання веб-сайту shop4ik.com.ua, в тому числі, перегляд інформації, користування сервісами, реєстрація, замовлення товарів тощо, здійснюється у відповідності до умов цієї публічної оферти (далі – Публічна оферта), яка включає в себе умови, зазначені нижче, а також умови, зазначені у відповідних розділах (сторінках) веб-сайту shop4ik.com.ua.</p>
        <p>Використовуючи веб-сайт shop4ik.com.ua, в тому числі, але не обмежуючись, шляхом реєстрації на ньому та/або шляхом придбання (здійснення дій щодо придбання) та/або оплати Товару, Покупець беззастережно приймає всі умови Публічної оферти (здійснює акцепт умов Публічної оферти), погоджується виконувати їх та несе відповідальність за наслідки неознайомлення з ними.</p>
    </div>
</div>
<div class="info-page__content__body info-page__terms">
    <div class="terms__item__head icon-text d-flex align-items-center">
        <div class="icon-text__icon img-wrapper d-flex justify-content-center align-items-center">
            <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
                <path d="M16.2617 1.35742H6.0679C3.92454 1.35742 2.74384 2.53813 2.74384 4.68149V15.3185C2.74384 17.3067 4.07967 18.6426 6.0679 18.6426H16.2617C17.3609 18.6426 18.2562 17.7482 18.2562 16.6481V11.3296V9.11358V3.35186C18.2562 2.25182 17.3609 1.35742 16.2617 1.35742ZM6.0679 2.68705H16.2617C16.6278 2.68705 16.9265 2.98489 16.9265 3.35186V9.11358V11.3296C16.9265 11.6966 16.6278 11.9944 16.2617 11.9944H6.0679C5.28697 11.9944 4.61152 12.2063 4.07346 12.5777V4.68149C4.07346 3.28361 4.67002 2.68705 6.0679 2.68705ZM16.2617 17.313H6.0679C4.81894 17.313 4.07346 16.5675 4.07346 15.3185C4.07346 14.0695 4.81894 13.3241 6.0679 13.3241H16.2617C16.4957 13.3241 16.7173 13.2763 16.9265 13.2018V16.6481C16.9265 17.0151 16.6278 17.313 16.2617 17.313ZM7.17593 5.56791C7.17593 5.20093 7.47376 4.9031 7.84074 4.9031H13.1593C13.5262 4.9031 13.8241 5.20093 13.8241 5.56791C13.8241 5.93489 13.5262 6.23272 13.1593 6.23272H7.84074C7.47376 6.23272 7.17593 5.93489 7.17593 5.56791ZM7.17593 8.22716C7.17593 7.86019 7.47376 7.56235 7.84074 7.56235H11.3864C11.7534 7.56235 12.0512 7.86019 12.0512 8.22716C12.0512 8.59414 11.7534 8.89198 11.3864 8.89198H7.84074C7.47376 8.89198 7.17593 8.59414 7.17593 8.22716Z" fill="#6757A9"/>
            </svg>
        </div>
        <h4 class="icon-text__text font-16-22 fw-600">Положення та умови</h4>
    </div>
    <div class="terms__item__text font-13-16 fw-400">
        <p>2.1. Товар на Сайті може бути замовлений та придбаний тільки для особистого некомерційного використання (споживання).</p>
        <p>2.2. Здійснюючи реєстрацію та/або придбання Товару на Сайті (вчинення дій щодо придбання Товару, оформлення Замовлення, оплати Товару, безпосереднє Замовлення Товару тощо), особа засвідчує, що вона:</p>
            <ul>
                <li>досягла 18-річного віку, володіє повною цивільною дієздатністю та купуватиме Товар виключно для особистого некомерційного використання (споживання);</li>
                <li>ознайомлена, беззастережно приймає та погоджується з усіма умовами Публічної оферти та умовами, викладеними у розділах (сторінках) Сайту;</li>
                <li>ознайомлена, беззастережно приймає та погоджується виконувати усі умови Публічної оферти; зазначає дані (П.І.Б., мобільний телефон, e-mail тощо), що є правдивими та належать саме їй, або авторизується під власним обліковим записом у соціальній мережі;</li>
                <li>погоджується на передачу своїх персональних даних третім особам (в тому числі іноземним суб'єктам відносин, пов'язаних з персональними даними), їх обробку, зберігання, передачу і використання з метою та на умовах, визначених Публічною офертою, та засвідчує отримання інформації про володільця персональних даних, склад та зміст зібраних персональних даних, свої права згідно законодавства, мету збору персональних даних та осіб, яким передаються її персональні дані.</li>
            </ul>
        <p>2.3. При користуванні Сайтом Покупець має право використовувати лише ті персональні дані, банківські картки, банківські рахунки, документи, що належать йому на законних підставах (оформлені на його ім’я в установленому законом порядку).</p>
        <p>2.4. Дані Покупця, зазначені при реєстрації та/або придбанні Товару на Сайті, зберігаються Адміністратором/Продавцем і відображаються у Профілі та використовуються Адміністратором та Продавцями в подальшому при здійсненні та / або виконанні Замовлень Покупця.</p>
        <p>2.5. Покупець має право змінювати та доповнювати надані ним дані в Профілі протягом всього строку здійснення покупок на Сайті.</p>
        <p>2.6. Розміщуючи на Сайті свої пропозиції щодо пропонування Товару, Продавець, який не є Адміністратором, погоджується та зобов’язується дотримуватись Публічної оферти, включаючи всі умови, зазначені нижче та у відповідних розділах (на сторінках) Сайту.</p>
    </div>
</div>
